#include <stdio.h>

#include "test.h"

/**
 * Напечатать  консоль процесс перекладывания дисков с пирамидки x на пирамидку
 * z. Цель - переложить все диски с пирамидки x на пирамидку z.
 *
 * Циклы for, while использовать запрещено.
 *
 * Примеры:
 * hanoi(2, 'x', 'y', 'z');
 * x -> z
 * x -> y
 * z -> y
 *
 * @param n количество дисков на первой пирамидке
 * @param x имя первой пирамидки
 * @param y имя первой пирамидки
 * @param z имя первой пирамидки
 */
void hanoi(int n, char x, char y, char z) {
  // Напиши меня!
  printf("%c -> %c\n", x, y);  // эта строчка останется тут
  // Напиши меня!
}

void test(void) {
  // Это тесты. НЕ УДАЛЯЙТЕ ИХ!
  // Преподаватель будет грустить, если вы удалите тесты T_T.
  // Тесты проверяют, что ваш код работает правильно.
  // Если задача решена неправильно,
  // то в консоли вы увидите ошибку и пояснение.
  // Сдавайте лабу, когда устраните все ошибки в тестах.
  // Если возникли трудности, то попросите преподавателя вам помочь ^_^.

  printf("\nhanoi(2, 'x', 'y', 'z')\n");
  hanoi(2, 'x', 'y', 'z');
  // x -> z
  // x -> y
  // z -> y

  printf("\nhanoi(3, 'x', 'y', 'z')\n");
  hanoi(3, 'x', 'y', 'z');
  // x -> y
  // x -> z
  // y -> z
  // x -> y
  // z -> x
  // z -> y
  // x -> y

  printf("\nhanoi(4, 'x', 'y', 'z')\n");
  hanoi(4, 'x', 'y', 'z');
  // x -> z
  // x -> y
  // z -> y
  // x -> z
  // y -> x
  // y -> z
  // x -> z
  // x -> y
  // z -> y
  // z -> x
  // y -> x
  // z -> y
  // x -> z
  // x -> y
  // z -> y
}

int main(void) {
  test();
  return 0;
}
