#include <stdio.h>

#include "test.h"

/**
 * возвращающую значение x с инвертированными n битами, начиная с позиции p
 * (остальные биты не изменяются).
 *
 * @param x - беззнаковое 8-битное число, над которым применяется операция
 * @param p - индекс первого бита в x, который будет инвертирован
 * @param n - количество подряд идущих битов после p, которые будут
 * инвертированы
 * @return возвращает беззнаковое 8-битное число как результат
 */
unsigned char invert(unsigned char x, unsigned char p, unsigned char n) {
  // TODO: напиши меня!!!
  return x * p * n;  // исправь меня
}

void cli(void) {
  // TODO: напиши меня
  // 1. Запросите у пользователя числа x p n
  // 2. примените invert
  // 3. выведите результат как число в 10-ой системе счисления
}

void test(void) {
  // Это тесты. НЕ УДАЛЯЙТЕ ИХ!
  // Преподаватель будет грустить, если вы удалите тесты T_T.
  // Тесты проверяют, что ваш код работает правильно.
  // Если задача решена неправильно,
  // то в консоли вы увидите ошибку и пояснение.
  // Сдавайте лабу, когда устраните все ошибки в тестах.
  // Если возникли трудности, то попросите преподавателя вам помочь ^_^.

  ASSERT_UCHAR(82, ==, invert(42, 3, 4));
}

int main(void) {
  test();
  cli();
  return 0;
}
