#include "test.h"

// palindrom - возвращает 1, если число n палиндром, иначе возвращает 0
// Число является палиндромом, если оно записывается слева направо точно так же
// как и справа налево. Например: число 1234 не палиндром, так как 1234 != 4321.
// число 12321 - палиндром. Число 123321 - тоже палиндром.
int palindrom(long n) {
  // Напиши меня!
  return n;
}

int main(void) {
  // Это тесты. НЕ УДАЛЯЙТЕ ИХ!
  // Преподаватель будет грустить, если вы удалите тесты T_T.
  // Тесты проверяют, что ваш код работает правильно.
  // Если в задача решена неправильно,
  // то в консоли вы увидите ошибку и пояснение.
  // Сдавайте лабу, когда устраните все ошибки в тестах.
  // Если возникли трудности, то попросите преподавателя вам помочь ^_^.

  ASSERT_TRUE(palindrom(1));
  ASSERT_TRUE(palindrom(0));
  ASSERT_TRUE(palindrom(123321));
  ASSERT_TRUE(palindrom(12321));
  ASSERT_TRUE(palindrom(657756));
  ASSERT_FALSE(palindrom(42));
  ASSERT_FALSE(palindrom(42240));
  ASSERT_FALSE(palindrom(345643));
  return 0;
}
