#include <stdio.h>

#include "test.h"

// sqrt_neuton - вычисляет квадратный корень числа x методом Ньютона.
// Если вычислить квадратный корень невозможно, то возвращает -1.
double sqrt_neuton(double x) {  // менять сигнатуру функции нельзя
  // TODO: напиши меня!
  // HINT: если нужно, можете объявить еще функции
  return x;
}

void cli_interface() {
  // 1. Запросите пользователя ввести число N типа double
  // 2. Вычислите квадратныый корень этго числа функцией sqrt_neuton
  // 3. Выведите в консоль результата
}

void test() {
  // Это тесты. НЕ УДАЛЯЙТЕ ИХ!
  // Преподаватель будет грустить, если вы удалите тесты T_T.
  // Тесты проверяют, что ваш код работает правильно.
  // Если задача решена неправильно,
  // то в консоли вы увидите ошибку и пояснение.
  // Сдавайте лабу, когда устраните все ошибки в тестах.
  // Если возникли трудности, то попросите преподавателя вам помочь ^_^.

  ASSERT_DOUBLE_EQUAL(2, sqrt_neuton(4), 0.0000001);
  ASSERT_DOUBLE_EQUAL(9, sqrt_neuton(81), 0.0000001);
  ASSERT_DOUBLE_EQUAL(3.42, sqrt_neuton(3.4 * 3.42), 0.0000001);
  ASSERT_DOUBLE_EQUAL(12446.2, sqrt_neuton(12446.2 * 12446.2), 0.0000001);
  ASSERT_DOUBLE_EQUAL(0.001, sqrt_neuton(0.001 * 0.001), 0.0000001);
  ASSERT_DOUBLE_EQUAL(-1, sqrt_neuton(-9), 0.0000001);
}

int main(void) {
  test();
  cli_interface();
  return 0;
}
