#include <stdlib.h>

#include "test.h"

/**
 * Копирует нультерминальную строку из src в dst.
 *
 * @param dest указатель на массив символов, куда скопировать строку.
 * @param src указатель на нультерминальну строку, откуда копировать.
 */
void str_copy(char* dst, const char* src) {
  // TODO: напиши меня!
  dst[0] = src[0];  // исправь меня!
}

void test(void) {
  // Это тесты. НЕ УДАЛЯЙТЕ ИХ!
  // Преподаватель будет грустить, если вы удалите тесты T_T.
  // Тесты проверяют, что ваш код работает правильно.
  // Если задача решена неправильно,
  // то в консоли вы увидите ошибку и пояснение.
  // Сдавайте лабу, когда устраните все ошибки в тестах.
  // Если возникли трудности, то попросите преподавателя вам помочь ^_^.
  {
    char str[6];
    str_copy(str, "Hello");
    ASSERT_STR_EQUAL(str, "Hello");
  }
  {
    char* str = (char*)calloc(6, sizeof(char));
    str_copy(str, "Hello");
    ASSERT_STR_EQUAL(str, "Hello");
  }
}

int main(void) {
  test();
  return 0;
}
