#include <stdlib.h>

#include "test.h"

/**
 * Фильтрует массив целых чисел по условию.
 * Возвращает те элементы массива, которые удовлетворяют заданному условию.
 * Выделяет память для нового массива и копирует в него удовлетворяющие условию
 * элементы.
 *
 * @param src массив для фильтрации
 * @param count размер массива
 * @param dest указатель на область памяти, куда должен быть записан результат
 * @param predicate указатель на функцию фильтрации
 * @return количество элементов в отфильтрованном массиве dest
 */
int filter(const int* src, int count, int** dest, int (*predicate)(int)) {
  // TODO: напиши меня!
  // HINT: можно 2 раза пробежаться по массиву src
  return 0;
}

/**
 * Проверяет, является ли число чётным.
 *
 * @param n число на проверку
 * @return 1 если число четное, иначе 0.
 */
int is_even(int n) { return n % 2 == 0; }

/**
 * Проверяет, является ли число палиндромом.
 *
 * @param n число на проверку
 * @return 1 если число палиндром, иначе 0
 */
int is_palindrom(int n) {
  // TODO: напиши меня!
  return 1;
}

void test(void) {
  // Это тесты. НЕ УДАЛЯЙТЕ ИХ!
  // Преподаватель будет грустить, если вы удалите тесты T_T.
  // Тесты проверяют, что ваш код работает правильно.
  // Если задача решена неправильно,
  // то в консоли вы увидите ошибку и пояснение.
  // Сдавайте лабу, когда устраните все ошибки в тестах.
  // Если возникли трудности, то попросите преподавателя вам помочь ^_^.

  {
    int arr[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
    int* res;
    int n = filter(arr, 10, &res, is_even);
    ASSERT_INT(5, ==, n);
    for (int i = 0; i < n; i++) {
      ASSERT_TRUE(is_even(arr[i]));
    }
    free(res);
  }
  {
    int arr[1000];
    for (int i = 0; i < 1000; i++) {
      arr[i] = i;
    }
    int* res;
    int n = filter(arr, 1000, &res, is_palindrom);
    ASSERT_INT(109, ==, n);
    free(res);
  }
}

int main(void) {
  test();
  return 0;
}
